#+BEGIN_src
  ██▓███  ▒██   ██▒
 ▓██░  ██▒▒▒ █ █ ▒░
 ▓██░ ██▓▒░░  █   ░
 ▒██▄█▓▒ ▒ ░ █ █ ▒
 ▒██▒ ░  ░▒██▒ ▒██▒
 ▒▓▒░ ░  ░▒▒ ░ ░▓ ░
 ░▒ ░     ░░   ░▒ ░
 ░░        ░    ░
#+END_SRC 

 Project Switcher
    Manages your Matlab project paths and dependencies with speed and ease.

 Note: currently under active development. I'm currently using matlab primarily on R2018b and R2017a, so things may not work for earlier versions.
       I'm using it actively on Linux, MacOS, and Windows so should work fine for any of these, although it may be particularly buggy for Windows.

* Setup:
Setup mex if you havn't already

Run in terminal:
#+BEGIN_src bash
 git clone https://github.com/portalgun/Px
#+END_SRC

#+BEGIN_src octave
 cd Px % assuming you've cloned it to home
 Px.installPx(installLocation,projectDirectory);
#+END_SRC

#+RESULTS:
Where 'installLocation' is where you want to be installing Px.
A good place is your userpath, which is usually '$HOME/Documents/MATLAB').
Where projectDirectory is where your existing project files are.
Px will then set up a directory structure in installLocation/.px and insert some lines into your startup.m file.
If you don't have a userspace startup file, Px will create you a new one.

The variable projectDirectory is where you keep your current projects.  If you don't have a place, Px will continue. Because the Px directory structure is supposed to be hands-off, you should provide one.
Px will not move your files, so you can continue to work with them as you did previously.


